Repository: desmaraisp/google-drive-sync
Catalog: src/Strings.*.resx
Languages: es

# Msg_SavedAuthWarning
source: This database contains a saved authorization token for Drive access. Click OK to use this token to access Drive. Click Cancel to remove the token and re-authorize this KeePass session with Google Sign-On. This warning is shown when database-stored authorization tokens are found. To avoid the warning, configure session-stored authorization tokens for this database.
es: Esta base de datos contiene un token de autorización guardado para el acceso a Drive. Haga clic en Aceptar para utilizar este token para acceder a Drive. Haga clic en Cancelar para eliminar el token y volver a autorizar esta sesión de KeePass con Google Sign-On. Esta advertencia se muestra cuando se encuentran tokens de autorización almacenados en la base de datos. Para evitar la advertencia, configure tokens de autorización almacenados en la sesión para esta base de datos.

# Lbl_DontShowSavedAuthWarning
source: Disable warning and always use database-stored authorization tokens if possible.
es: Deshabilite la advertencia y siempre use tokens de autorización almacenados en la base de datos si es posible.

# Lnk_SessionAuthTokens
source: Session-stored Authorization Tokens
es: Tokens de autorización almacenados en la sesión

# Exc_DbClosedOnAutoSync
source: An auto-sync operation failed because the database was closed. This could be caused by another plugin or a composite KP operation. Retry the operation manually when the database is opened.
es: Una operación de sincronización automática falló porque se cerró la base de datos. Esto podría deberse a otro complemento o una operación de KP compuesta. Vuelva a intentar la operación manualmente cuando se abra la base de datos.

# Msg_DeferredAutoSyncFmt
source: Database {0} did not Auto Sync the last time changes were saved, because the KeePass {1} operation which saved the changes also closed the database. The local database could be out of sync with the Drive file. Would you like to sync the database now?
es: La base de datos {0} no se sincronizó automáticamente la última vez que se guardaron los cambios, porque la operación KeePass {1} que guardó los cambios también cerró la base de datos. Es posible que la base de datos local no esté sincronizada con el archivo de Drive. ¿Le gustaría sincronizar la base de datos ahora?

# OpName_KpAutoLock
source: auto-lock
es: Bloqueo Automático

# OpName_KpExit
source: exit
es: Salida

# Lbl_AutoSyncOnReopen
source: Resume on return from Auto-Lock or Exit
es: Reanudar al regresar de Bloqueo Automático

# Btn_About
source: About This Plugin
es: Sobre esto

# Lnk_PrivacyPolicy
source: Privacy Policy
es: Política de privacidad
