Repository: desmaraisp/google-drive-sync
Catalog: src/Strings.*.resx
Languages: es

# Btn_CopyPassword
source: Copy Password
es: Copiar contraseña

# Btn_CopyUser
source: Copy User
es: Copiar usuario

# Btn_DlgCancel
source: &Cancel
es: &Cancelar

# Btn_GetColors
source: Get All Drive Folder Colors
es: Obtén colores para las carpetas de Drive

# Btn_UseLegacyCreds
source: Enable Legacy OAuth 2.0 Credentials
es: Habilitar credenciales de OAuth 2.0 heredadas

# Btn_UseLegacyCredsDowngrade
source: Continue using KeePass Google Sync 3.0 credentials.
es: Continúe usando las credenciales KeePass Google Sync 3.0.

# Btn_UseNewCredsUpgrade
source: Upgrade the plugin's Google Drive Authorization (Recommended).
es: Actualice la autorización de Google Drive del complemento (recomendado).

# Descr_KpDbFile
source: KeePass Password Safe Database
es: Base de datos segura de contraseña de KeePass

# Err_LoadConfigurationFailed
source: An error occurred loading the plug-in configuration.
es: Se produjo un error al cargar la configuración del complemento.

# Err_TokenAccessDenied
source: Access authorization request denied.
es: Solicitud de autorización de acceso denegada.

# Err_TokenInvalidClient
source: Either Client ID or Client Secret is invalid.
es: La identificación del cliente o el secreto del cliente no es válido.

# Err_TokenInvalidGrant
source: The provided authorization grant (e.g., authorization code, resource owner credentials) or refresh token is invalid, expired, revoked, does not match the redirection URI used in the authorization request, or was issued to another client.
es: La concesión de autorización proporcionada (por ejemplo, código de autorización, credenciales del propietario del recurso) o token de actualización no es válida, caducó, se revocó, no coincide con el URI de redireccionamiento utilizado en la solicitud de autorización o se emitió a otro cliente.

# Err_TokenInvalidReq
source: Either Client ID or Client Secret is missing.
es: Falta la identificación del cliente o el secreto del cliente.

# Err_TokenInvalidScope
source: The requested scope is invalid, unknown, malformed, or exceeds the scope granted by the resource owner.
es: El alcance solicitado es inválido, desconocido, malformado o excede el alcance otorgado por el propietario del recurso.

# Err_TokenUnauthClient
source: The authenticated client is not authorized to use this authorization grant type.
es: El cliente autenticado no está autorizado para usar este tipo de autorización.

# Err_TokenUnsupportedGrant
source: The authorization grant type is not supported by the authorization server.
es: El tipo de concesión de autorización no es compatible con el servidor de autorización.

# Exc_MultipleGDriveFilesFmt
source: The operation was cancelled because more than one file named '{0}' was found in the Target Folder. This can occur when files are copied or created by another program with limited authorization credentials. Resolve the conflict manually (e.g., examine Drive file modification times) and ensure only one file named '{0}' exists in the target Drive folder.
es: La operación se canceló porque se encontró más de un archivo llamado '{0}' en la carpeta de destino. Esto puede ocurrir cuando los archivos son copiados o creados por otro programa con credenciales de autorización limitadas. Resuelva el conflicto manualmente (p. Ej., Examine los tiempos de modificación del archivo de Drive) y asegúrese de que solo exista un archivo llamado "{0}" en la carpeta de Drive de destino.

# Exc_NoImportPermission
source: Synchronization failed. You do not have permission to import. Adjust your KeePass configuration.
es: La sincronización falló. No tienes permiso para importar. Ajuste su configuración de KeePass.

# Exc_SyncFailureOther
source: Synchronization failed. If the error was that master keys (passwords) do not match, use Upload / Download commands instead of Sync or change the local master key to match that of the remote database.
es: La sincronización falló. Si el error fue que las claves maestras (contraseñas) no coinciden, use los comandos Cargar / Descargar en lugar de Sincronizar o cambie la clave maestra local para que coincida con la de la base de datos remota.

# Html_AuthResponseString
source: <!DOCTYPE html> <html lang="en" xmlns="http://www.w3.org/1999/xhtml"> <head> <meta charset="utf-8" http-equiv='refresh' content='5;url={0}'> <title>Google Sign-In Authorization</title> </head> <body> <h1>Google Sign-In Authorization Complete</h1> <div>Please return to KeePass.</div> </body> </html>
es: <!DOCTYPE html> <html lang="es" xmlns="http://www.w3.org/1999/xhtml"> <head> <meta charset="utf-8" http-equiv='refresh' content='5;url={0}'> <title>Autorización de Google Sign-In</title> </head> <body><h1>Autorización de Google Sign-In Completa</h1><div>Por favor regrese a KeePass.</div></body> </html>

# Lbl_FolderName
source: Drive Sync Folder:
es: Carpeta de Drive:

# Lbl_OauthCreds
source: Custom OAuth 2.0 Credentials
es: Credenciales personalizadas de OAuth 2.0

# Lnk_Help
source: Help
es: Ayuda

# Lnk_HelpAppCredsUpgrade
source: More upgrade information available at {0}.
es: Más información de actualización disponible en {0}.

# Lnk_Home
source: Visit KPSync.org.
es: Los KPSync.org.

# Lnk_SignInHelp
source: Sign-In Problem?
es: ¿Problema de Sign-In?

# MenuLabel_Config
source: Configure
es: Configurar

# MenuLabel_Download
source: Download from Drive
es: Descargar desde Drive

# MenuLabel_Sync
source: Sync with Drive
es: Sincronizar con Drive

# MenuLabel_Upload
source: Upload to Drive
es: Subir a Drive

# Msg_AppCredsUpgrade
source: Upgrading eliminates problems with the old plugin's built-in OAuth 2.0 credentials, which have exceeded Google's limits for new authorizations. Using the new built-in credentials is recommended unless you have compelling reasons to use personal OAuth 2.0 credentials. After upgrading, you will be required to re-authorize with Google Sign-in. Click Cancel to decide later and abandon the current plugin operation.
es: La actualización elimina los problemas con las credenciales OAuth 2.0 integradas del antiguo complemento, que han excedido los límites de Google para nuevas autorizaciones. Se recomienda usar las nuevas credenciales integradas a menos que tenga razones convincentes para usar las credenciales personales de OAuth 2.0. Después de actualizar, se le solicitará que vuelva a autorizar con Google Sign-in. Haga clic en Cancelar para decidir más tarde y abandonar la operación actual.

# Msg_AuthDialog
source: The system Browser has been opened for you to sign in to your Google account (if necessary) and authorize the plugin to sync your KeePass database. The plugin cannot operate without your authorization. If the plugin entry includes your Google user name and password, you may access them via the buttons below. This notification window closes automatically after authorization in the browser is complete. To return to KeePass without authorizing the plugin, click Cancel.
es: Se ha abierto el navegador del sistema para que pueda iniciar sesión en su cuenta de Google y / o autorizar el complemento para sincronizar su base de datos KeePass. El complemento no puede funcionar sin su autorización. Si la entrada del complemento incluye su nombre de usuario y contraseña de Google, puede acceder a ellos mediante los botones a continuación. Esta ventana de notificación se cierra automáticamente después de completar la autorización en el navegador. Para volver a KeePass sin autorizar el complemento, haga clic en Cancelar.

# Msg_AutoSyncIgnore
source: Shift Key pressed. Auto Sync ignored.
es: Tecla Shift presionada. Sincronización automática ignorada.

# Msg_ChangedCredsDeletesToken
source: You have changed settings that effect the Drive authorization token saved in the database. Proceeding will delete the token and you may be required to Sign-in the next time the plugin accesses Drive. Click OK to confirm.
es: Ha cambiado la configuración que afecta al token de autorización de Drive guardado en la base de datos. Continuar borrará el token y es posible que deba iniciar sesión la próxima vez que el complemento acceda a Drive. Haga clic en Aceptar para confirmar.

# Msg_DatabaseSaved
source: Database saved to local file.
es: Base de datos guardada en archivo local.

# Msg_DownloadFileFmt
source: Getting a copy of '{0}' file from Drive...
es: Obteniendo una copia del archivo '{0}' de Drive ...

# Msg_FileNotDownloaded
source: File could not be downloaded.
es: El archivo no se pudo descargar.

# Msg_FileUpdatedFmt
source: File on Google Drive updated. Name: {0}, ID: {1}
es: Archivo en Google Drive actualizado. Nombre: {0}, ID: {1}

# Msg_FileUploadedFmt
source: File uploaded to Google Drive. Name: {0}, ID: {1}
es: Archivo subido a Google Drive. Nombre: {0}, ID: {1}

# Msg_FirstOpenDb
source: You first need to open a database.
es: Primero necesita abrir una base de datos.

# Msg_FolderColorsRetrieved
source: Available folder colors retrieved.
es: Colores de carpeta disponibles recuperados.

# Msg_GDriveFileNotFound
source: File name not found on Google Drive. Please upload or sync with Google Drive first.
es: Nombre de archivo no encontrado en Google Drive. Cargue o sincronice primero con Google Drive.

# Msg_LocalDbOnly
source: Only databases stored locally or on a network share are supported. Save your database locally or on a network share and try again.
es: Solo se admiten bases de datos almacenadas localmente o en un recurso compartido de red. Guarde su base de datos localmente o en un recurso compartido de red e intente nuevamente.

# Msg_LocalSyncComplete
source: Local file synchronized.
es: Archivo local sincronizado.

# Msg_NewEntryNotesFmt
source: This entry was generated by {0}. Consider adding your Google user and password to this entry. This will allow you to access them if you ever need to authorize the plugin again.
es: Esta entrada fue generada por {0}. Considere agregar su usuario y contraseña de Google a esta entrada. Esto le permitirá acceder a ellos si alguna vez necesita autorizar el complemento nuevamente.

# Msg_NoAcct
source: No Plugin Configuration Entry Found The plugin requires a KeePass entry to store Google Drive authorization data. It is convenient if this entry also contains your Google Sign-in user/password. To create an entry without credentials (you can add them later), click Yes. Otherwise, return to KeePass to create a new entry or edit an existing one, ensuring that the entry's URL field contains the string '{0}'.
es: Sin entrada de configuración de Plugin El complemento requiere una entrada KeePass para almacenar los datos de autorización de Google Drive. Es conveniente si esta entrada también contiene su usuario / contraseña de Google Sign-in. Para crear una entrada sin credenciales (puede agregarlas más tarde), haga clic en Sí. De lo contrario, regrese a KeePass para crear una nueva entrada o editar una existente, asegurándose de que el campo URL de la entrada contenga la cadena '{0}'.

# Msg_NoAutoSyncConfig
source: No valid configuration found. Auto Sync ignored.
es: No se encontró una configuración válida. Sincronización automática ignorada.

# Msg_OauthCredsInvalidFmt
source: Please enter a valid custom OAuth 2.0 Client ID and Client Secrect for {0} or select Legacy Client ID.
es: Ingrese un ID de cliente personalizado de OAuth 2.0 válido y un Secreto de cliente para {0} o use los valores predeterminados.

# Msg_PasswdUuidEntryMissingFmt
source: Password entry with UUID '{0}' not found.
es: No se encontró la entrada de contraseña con UUID '{0}'.

# Msg_PleaseWaitEllipsis
source: Please wait ...
es: Por favor espera ...

# Msg_ProductAbortedFmt
source: {0} cancelled.
es: {0} cancelado.

# Msg_RefreshTokenAuth
source: Trying previous Google Drive authorization...
es: Intentando la autorización previa de Google Drive ...

# Msg_ReopenDatabase
source: Re-opening database...
es: Reapertura de la base de datos ...

# Msg_ReplaceDbFailedFmt
source: Replacing current database failed. File downloaded as '{0}'.
es: Reemplazar la base de datos actual falló. Archivo descargado como '{0}'.

# Msg_ReplaceDbStatusFmt
source: Database '{0}' replaced by copy of Google Drive File.
es: La base de datos '{0}' se reemplazó por una copia del archivo de Google Drive.

# Msg_ReplaceFileFmt
source: Replacing '{0}' file on Drive...
es: Reemplazando el archivo '{0}' en Drive ...

# Msg_ReplacingFile
source: Replacing local copy of file with downloaded file...
es: Reemplazar la copia local del archivo con el archivo descargado ...

# Msg_RetrievingFolderFmt
source: Looking for folders named '{0}'...
es: Buscando carpetas llamadas '{0}' ...

# Msg_RetrievingGDriveFileFmt
source: Looking for '{0}' file on Drive...
es: Buscando el archivo '{0}' en Drive ...

# Msg_SaveUserAuth
source: Adding user authorization token to the database...
es: Agregar token de autorización de usuario a la base de datos ...

# Msg_SavingDatabase
source: Saving current database to disk...
es: Guardando la base de datos actual en el disco ...

# Msg_Synchronizing
source: Synchronizing current database with Drive copy...
es: Sincronizando la base de datos actual con Drive copy ...

# Msg_TempClose
source: Temporarily closing database...
es: Cerrar temporalmente la base de datos ...

# Msg_UploadingFileFmt
source: Uploading '{0}' file to Drive...
es: Subiendo el archivo '{0}' a Drive ...

# Msg_UploadingSync
source: Uploading copy of synchronized database to Drive...
es: Subiendo copia de la base de datos sincronizada a Drive ...

# Msg_UserAuth
source: User must authorize Google Drive access.
es: El usuario debe autorizar el acceso a Google Drive.

# Msg_UuidEntryInvalid
source: The entered UUID is not valid.
es: El UUID ingresado no es válido.

# Opt_AutoSyncBoth
source: Both
es: A la vez

# Opt_AutoSyncDisabled
source: Disabled
es: Desactivada

# Opt_AutoSyncOpen
source: Open
es: Abrir

# Opt_AutoSyncSave
source: Save
es: Guardar

# Opt_CustomKpUuid
source: Deprecated KeePass UUID
es: UUID de KeePass en desuso

# Title_AuthDialogSub
source: Please Do Not Close This Window
es: Por favor no cierre esta ventana

# Title_ConfigDialog
source: Configuration
es: Configuración

# Group_DriveOptions
source: Google Drive Features
es: Funciones de Google Drive

# Group_FolderDefaults
source: Folder Option Defaults
es: Opciones predeterminadas de carpeta

# Lbl_AuthPwEntry
source: KeePass Entry Title:
es: Título de entrada de KeePass:

# Lbl_AutoSyncOnOpen
source: Sync before Opening a KeePass Database
es: Sincronizar antes de abrir una base de datos KeePass

# Lbl_AutoSyncOnSave
source: Sync when Saving a KeePass Database
es: Sincronizar al guardar una base de datos KeePass

# Lbl_CurrentDbFmt
source: Database: {0}
es: Base de datos: {0}

# Lbl_DefaultTargetFolder
source: Default Target Sync Folder:
es: Carpeta de sincronización de destino predeterminada:

# Lbl_DefaultTargetFolderHint
source: (Leave blank to use a single, uniquely named file across all folders.)
es: (Déjelo en blanco para usar un solo archivo con un nombre único en cualquier carpeta).

# Lbl_DefaultTgtFolderColor
source: Default New Folder Color:
es: Color predeterminado de la nueva carpeta:

# Lbl_TargetFolder
source: Target Sync Folder:
es: Carpeta de sincronización de destino:

# Lbl_UseLegacyClientID
source: Use KeePass Google Sync 3.0 App Credentials.
es: Utilice las credenciales de la app KeePass Google Sync 3.0.

# Lbl_UseAppFileApiScope
source: Use limited Drive access.
es: Use acceso limitado a Drive.

# Title_DefaultsTab
source: Options and Defaults
es: Opciones y valores predeterminados

# Title_SyncAuthTab
source: Sync Authorization
es: Autorización de sincronización

# Msg_UserCancelledOpFmt
source: Operation cancelled by user.
es: Se canceló la operación.

# Lbl_DefaultClientID
source: Default Client ID:
es: Client ID por Defecto:

# Lbl_DefaultClientSecret
source: Default Client Secret:
es: Client Secret por Defecto:

# Title_AboutTab
source: About
es: Acerca de

# Title_AppCredsUpgradeMain
source: Upgrade Sign-in Authorization
es: Actualizar la autorización de Sign-in

# Group_Entry
source: Plugin Password Entry
es: Entrada de contraseña de Plugin

# Lbl_LegacyAttribution
source: Based on KeePass Google Sync Plugin 3.0, Copyright © 2016 DesignsInnovate.
es: Basado en KeePass Google Sync Plugin 3.0, Copyright © 2016 DesignsInnovate.

# Group_CmdEnabled
source: Enabled Commands (choose at least one)
es: Comandos habilitados (por lo menos uno)

# Lbl_DownloadEnabled
source: Download
es: Descargar

# Lbl_SyncEnabled
source: Sync with Drive
es: Sinc con Drive

# Lbl_UploadEnabled
source: Upload
es: Subir

# Msg_NoActiveAccount
source: Plugin-Compatible Entries Found One or more entries in this database can store the plugin's configuration data. Click OK to open the Configuration dialog, allowing selection and configuration of an active plugin entry. Otherwise click Cancel to abandon this operation. In either case, you can select another entry later to be the active plugin entry, with the Configuration command on the plugin menu.
es: Se encontraron entradas compatibles con complementos Una o más entradas en esta base de datos pueden almacenar datos de autorización de Google Drive. Haga clic en Aceptar para abrir el cuadro de diálogo Configuración, que permite la selección y configuración de una entrada de complemento activa. De lo contrario, haga clic en Cancelar para abandonar esta operación. En cualquier caso, puede seleccionar otra entrada más tarde para que sea la entrada activa del complemento, con el comando Configuración en el menú del complemento.

# Lnk_HelpAppCredsPrivacy
source: KPSync for Google Drive privacy policy.
es: Política de privacidad de KPSync para Google Drive.

# Exc_MultipleGDriveFilesFmt_NoFolder
source: More than one file or shortcut named '{0}' found on Google Drive. Please make sure the name is unique across all folders, or use the Target Folder feature.
es: Se encontró más de un archivo o acceso directo llamado "{0}" en Google Drive. Asegúrese de que el nombre sea único en todas las carpetas o utilice la función Carpeta de destino.

# Exc_MultipleFilesAndFolderFmt
source: More than on folder named '{1}' was found on Google Drive, and multiple files and/or shortcuts named '{0}' are contained by them. Please make sure the name is unique across all folders specified by Target Folder.
es: Se encontró más que en la carpeta llamada "{1}" en Google Drive, y contienen varios archivos y / o accesos directos llamados "{0}". Asegúrese de que el nombre sea único en todas las carpetas especificadas por la carpeta de destino.

# Exc_MultipleFoldersFmt
source: More than on folder named '{1}' was found on Google Drive. The Target Folder must be unique, either my name or by exclusively containing a file named '{0}'.
es: Se encontró más que en la carpeta llamada "{1}" en Google Drive. La carpeta de destino debe ser única, ya sea mi nombre o contener exclusivamente un archivo llamado '{0}'.

# Msg_CreatingFolderFmt
source: Creating new folder '{0}'...
es: Creando nueva carpeta '{0}' ...

# Exc_ShortcutNoLink
source: Invalid Drive Shortcut. A shortcut named '{0}' was found, but it is not linked to an accessible file.
es: Acceso directo a Drive no válido. Se encontró un acceso directo llamado '{0}', pero no está vinculado a un archivo.

# Exc_ShortcutTargetIdMissing
source: Invalid Drive Shortcut. A shortcut named '{0}' was found, but it does not contain a linked file ID.
es: Acceso directo a Drive no válido. Se encontró un acceso directo llamado '{0}', pero no contiene un ID de archivo vinculado.

# Msg_RetrievingGDriveShortcutFmt
source: Resolving Drive Shortcut '{0}' to ID:{1}...
es: Resolviendo el acceso directo de Drive '{0}' al ID: {1} ...

# Exc_ShortcutTargetTrashed
source: The Drive shortcut '{1}' links to file '{0}' in the Trash. To sync with '{0}', move it out of the Trash folder.
es: El acceso directo de Drive '{1}' se vincula al archivo '{0}' en la Papelera. Para sincronizar con '{0}', sáquelo de la carpeta Papelera.

# Title_SharedFileError
source: Shared Drive File Access Disabled
es: Acceso archivos compartidos de Drive deshabilitado

# SubTitle_SharedFileError
source: {0} is shared with other Drive accounts.
es: {0} se comparte con otras cuentas de Drive.

# Msg_SharedFileError
source: For plugin security, the current settings prohibit sync operations on this file. To safely sync this file, you need to enable session authorization tokens (Drive Authorization Token Handling) in the Sync Authorization tab of the settings dialog. Alternatively, you can configure the plugin to use personal OAuth 2.0 application credentials.
es: Para la seguridad del complemento, la configuración actual prohíbe las operaciones de sincronización en este archivo. Para sincronizar de forma segura este archivo, debe habilitar los tokens de autorización de sesión (Manejo de tokens de autorización de unidad) en la pestaña Autorización de sincronización del cuadro de diálogo de configuración. Alternativamente, puede configurar el complemento para usar credenciales de aplicación OAuth 2.0 personales.

# Lnk_SharedFileHelp
source: Shared File Risks
es: Riesgos de archivos compartidos

# Exc_SharedFile
source: Sync operations with files shared with other Drive accounts are not configured.
es: Las operaciones de sincronización con archivos compartidos con otras cuentas de Drive no están configuradas.

# Msg_SavingConfig
source: Saving configuration changes to the database...
es: Guardando cambios de configuración en la base de datos ...

# Msg_SavingSharedFileChoice
source: Saving your choice in the database entry...
es: Guardando su elección en la entrada de la base de datos ...

# Lnk_PersonalOauth
source: Personal App Credentials
es: Credenciales de aplicaciones personales

# Msg_MsgBoxLinkPrompt
source: Click 'Yes' for more information.
es: Haga clic en "Sí" para obtener más información.

# Group_AuthTokenSecurity
source: Drive Authorization Token Handling
es: Manejo del token de autorización de Drive

# Lbl_DontSaveAuthToken
source: Do not save Google Drive authorization in the database.
es: No guarde la autorización de Google Drive en la base de datos.

# Lnk_AuthTokenHelp
source: Why should this be enabled for shared databases?
es: ¿Por qué debería habilitarse esto para las bases de datos compartidas?

# Group_AuthTokenSecurityDefaults
source: Default Drive Authorization Token Handling
es: Manejo predeterminado del token de autorización de Drive

# Lbl_DontSaveAuthDefault
source: Do not save authorization tokens in new databases.
es: No guarde los tokens de autorización en bases de datos nuevas.

# Lbl_WarnEntryAuthToken
source: Warn me before using a stored authorization token.
es: Avisarme antes de usar un token de autorización almacenado.

# Lnk_AuthTokenAppHelp
source: Why should I do this if I use shared databases?
es: ¿Por qué debería hacer esto si uso bases de datos compartidas?

# Msg_AuthTokenPrompting
source: Auth token found: query user to proceed.
es: Token de autenticación encontrado: consulta al usuario para continuar.

# Title_SavedAuthWarning
source: Saved Authorization Token Found
es: Token de autorización guardado encontrado
